GopalSaraf/Practicals/PSDL/include/proc/pic16c745.inc
// Register: UIR
#define UIR UIR
UIR                                      equ 0190h
// bitfield definitions
UIR_USB_RST_POSN                         equ 0000h
UIR_USB_RST_POSITION                     equ 0000h
UIR_USB_RST_SIZE                         equ 0001h
UIR_USB_RST_LENGTH                       equ 0001h
UIR_USB_RST_MASK                         equ 0001h
UIR_UERR_POSN                            equ 0001h
UIR_UERR_POSITION                        equ 0001h
UIR_UERR_SIZE                            equ 0001h
UIR_UERR_LENGTH                          equ 0001h
UIR_UERR_MASK                            equ 0002h
UIR_ACTIVITY_POSN                        equ 0002h
UIR_ACTIVITY_POSITION                    equ 0002h
UIR_ACTIVITY_SIZE                        equ 0001h
UIR_ACTIVITY_LENGTH                      equ 0001h
UIR_ACTIVITY_MASK                        equ 0004h
UIR_TOK_DNE_POSN                         equ 0003h
UIR_TOK_DNE_POSITION                     equ 0003h
UIR_TOK_DNE_SIZE                         equ 0001h
UIR_TOK_DNE_LENGTH                       equ 0001h
UIR_TOK_DNE_MASK                         equ 0008h
UIR_UIDLE_POSN                           equ 0004h
UIR_UIDLE_POSITION                       equ 0004h
UIR_UIDLE_SIZE                           equ 0001h
UIR_UIDLE_LENGTH                         equ 0001h
UIR_UIDLE_MASK                           equ 0010h
UIR_STALL_POSN                           equ 0005h
UIR_STALL_POSITION                       equ 0005h
UIR_STALL_SIZE                           equ 0001h
UIR_STALL_LENGTH                         equ 0001h
UIR_STALL_MASK                           equ 0020h

// Register: UIE
#define UIE UIE
UIE                                      equ 0191h
// bitfield definitions
UIE_USB_RST_POSN                         equ 0000h
UIE_USB_RST_POSITION                     equ 0000h
UIE_USB_RST_SIZE                         equ 0001h
UIE_USB_RST_LENGTH                       equ 0001h
UIE_USB_RST_MASK                         equ 0001h
UIE_UERR_POSN                            equ 0001h
UIE_UERR_POSITION                        equ 0001h
UIE_UERR_SIZE                            equ 0001h
UIE_UERR_LENGTH                          equ 0001h
UIE_UERR_MASK                            equ 0002h
UIE_ACTIVITY_POSN                        equ 0002h
UIE_ACTIVITY_POSITION                    equ 0002h
UIE_ACTIVITY_SIZE                        equ 0001h
UIE_ACTIVITY_LENGTH                      equ 0001h
UIE_ACTIVITY_MASK                        equ 0004h
UIE_TOK_DNE_POSN                         equ 0003h
UIE_TOK_DNE_POSITION                     equ 0003h
UIE_TOK_DNE_SIZE                         equ 0001h
UIE_TOK_DNE_LENGTH                       equ 0001h
UIE_TOK_DNE_MASK                         equ 0008h
UIE_UIDLE_POSN                           equ 0004h
UIE_UIDLE_POSITION                       equ 0004h
UIE_UIDLE_SIZE                           equ 0001h
UIE_UIDLE_LENGTH                         equ 0001h
UIE_UIDLE_MASK                           equ 0010h
UIE_STALL_POSN                           equ 0005h
UIE_STALL_POSITION                       equ 0005h
UIE_STALL_SIZE                           equ 0001h
UIE_STALL_LENGTH                         equ 0001h
UIE_STALL_MASK                           equ 0020h

// Register: UEIR
#define UEIR UEIR
UEIR                                     equ 0192h
// bitfield definitions
UEIR_PID_ERR_POSN                        equ 0000h
UEIR_PID_ERR_POSITION                    equ 0000h
UEIR_PID_ERR_SIZE                        equ 0001h
UEIR_PID_ERR_LENGTH                      equ 0001h
UEIR_PID_ERR_MASK                        equ 0001h
UEIR_CRC5_POSN                           equ 0001h
UEIR_CRC5_POSITION                       equ 0001h
UEIR_CRC5_SIZE                           equ 0001h
UEIR_CRC5_LENGTH                         equ 0001h
UEIR_CRC5_MASK                           equ 0002h
UEIR_CRC16_POSN                          equ 0002h
UEIR_CRC16_POSITION                      equ 0002h
UEIR_CRC16_SIZE                          equ 0001h
UEIR_CRC16_LENGTH                        equ 0001h
UEIR_CRC16_MASK                          equ 0004h
UEIR_DFN8_POSN                           equ 0003h
UEIR_DFN8_POSITION                       equ 0003h
UEIR_DFN8_SIZE                           equ 0001h
UEIR_DFN8_LENGTH                         equ 0001h
UEIR_DFN8_MASK                           equ 0008h
UEIR_BTO_ERR_POSN                        equ 0004h
UEIR_BTO_ERR_POSITION                    equ 0004h
UEIR_BTO_ERR_SIZE                        equ 0001h
UEIR_BTO_ERR_LENGTH                      equ 0001h
UEIR_BTO_ERR_MASK                        equ 0010h
UEIR_WRT_ERR_POSN                        equ 0005h
UEIR_WRT_ERR_POSITION                    equ 0005h
UEIR_WRT_ERR_SIZE                        equ 0001h
UEIR_WRT_ERR_LENGTH                      equ 0001h
UEIR_WRT_ERR_MASK                        equ 0020h
UEIR_OWN_ERR_POSN                        equ 0006h
UEIR_OWN_ERR_POSITION                    equ 0006h
UEIR_OWN_ERR_SIZE                        equ 0001h
UEIR_OWN_ERR_LENGTH                      equ 0001h
UEIR_OWN_ERR_MASK                        equ 0040h
UEIR_BTS_ERR_POSN                        equ 0007h
UEIR_BTS_ERR_POSITION                    equ 0007h
UEIR_BTS_ERR_SIZE                        equ 0001h
UEIR_BTS_ERR_LENGTH                      equ 0001h
UEIR_BTS_ERR_MASK                        equ 0080h

// Register: UEIE
#define UEIE UEIE
UEIE                                     equ 0193h
// bitfield definitions
UEIE_PID_ERR_POSN                        equ 0000h
UEIE_PID_ERR_POSITION                    equ 0000h
UEIE_PID_ERR_SIZE                        equ 0001h
UEIE_PID_ERR_LENGTH                      equ 0001h
UEIE_PID_ERR_MASK                        equ 0001h
UEIE_CRC5_POSN                           equ 0001h
UEIE_CRC5_POSITION                       equ 0001h
UEIE_CRC5_SIZE                           equ 0001h
UEIE_CRC5_LENGTH                         equ 0001h
UEIE_CRC5_MASK                           equ 0002h
UEIE_CRC16_POSN                          equ 0002h
UEIE_CRC16_POSITION                      equ 0002h
UEIE_CRC16_SIZE                          equ 0001h
UEIE_CRC16_LENGTH                        equ 0001h
UEIE_CRC16_MASK                          equ 0004h
UEIE_DFN8_POSN                           equ 0003h
UEIE_DFN8_POSITION                       equ 0003h
UEIE_DFN8_SIZE                           equ 0001h
UEIE_DFN8_LENGTH                         equ 0001h
UEIE_DFN8_MASK                           equ 0008h
UEIE_BTO_ERR_POSN                        equ 0004h
UEIE_BTO_ERR_POSITION                    equ 0004h
UEIE_BTO_ERR_SIZE                        equ 0001h
UEIE_BTO_ERR_LENGTH                      equ 0001h
UEIE_BTO_ERR_MASK                        equ 0010h
UEIE_WRT_ERR_POSN                        equ 0005h
UEIE_WRT_ERR_POSITION                    equ 0005h
UEIE_WRT_ERR_SIZE                        equ 0001h
UEIE_WRT_ERR_LENGTH                      equ 0001h
UEIE_WRT_ERR_MASK                        equ 0020h
UEIE_OWN_ERR_POSN                        equ 0006h
UEIE_OWN_ERR_POSITION                    equ 0006h
UEIE_OWN_ERR_SIZE                        equ 0001h
UEIE_OWN_ERR_LENGTH                      equ 0001h
UEIE_OWN_ERR_MASK                        equ 0040h
UEIE_BTS_ERR_POSN                        equ 0007h
UEIE_BTS_ERR_POSITION                    equ 0007h
UEIE_BTS_ERR_SIZE                        equ 0001h
UEIE_BTS_ERR_LENGTH                      equ 0001h
UEIE_BTS_ERR_MASK                        equ 0080h

// Register: USTAT
#define USTAT USTAT
USTAT                                    equ 0194h
// bitfield definitions
USTAT_IN_POSN                            equ 0002h
USTAT_IN_POSITION                        equ 0002h
USTAT_IN_SIZE                            equ 0001h
USTAT_IN_LENGTH                          equ 0001h
USTAT_IN_MASK                            equ 0004h
USTAT_ENDP_POSN                          equ 0003h
USTAT_ENDP_POSITION                      equ 0003h
USTAT_ENDP_SIZE                          equ 0002h
USTAT_ENDP_LENGTH                        equ 0002h
USTAT_ENDP_MASK                          equ 0018h
USTAT_ENDP0_POSN                         equ 0003h
USTAT_ENDP0_POSITION                     equ 0003h
USTAT_ENDP0_SIZE                         equ 0001h
USTAT_ENDP0_LENGTH                       equ 0001h
USTAT_ENDP0_MASK                         equ 0008h
USTAT_ENDP1_POSN                         equ 0004h
USTAT_ENDP1_POSITION                     equ 0004h
USTAT_ENDP1_SIZE                         equ 0001h
USTAT_ENDP1_LENGTH                       equ 0001h
USTAT_ENDP1_MASK                         equ 0010h

// Register: UCTRL
#define UCTRL UCTRL
UCTRL                                    equ 0195h
// bitfield definitions
UCTRL_SUSPND_POSN                        equ 0001h
UCTRL_SUSPND_POSITION                    equ 0001h
UCTRL_SUSPND_SIZE                        equ 0001h
UCTRL_SUSPND_LENGTH                      equ 0001h
UCTRL_SUSPND_MASK                        equ 0002h
UCTRL_RESUME_POSN                        equ 0002h
UCTRL_RESUME_POSITION                    equ 0002h
UCTRL_RESUME_SIZE                        equ 0001h
UCTRL_RESUME_LENGTH                      equ 0001h
UCTRL_RESUME_MASK                        equ 0004h
UCTRL_DEV_ATT_POSN                       equ 0003h
UCTRL_DEV_ATT_POSITION                   equ 0003h
UCTRL_DEV_ATT_SIZE                       equ 0001h
UCTRL_DEV_ATT_LENGTH                     equ 0001h
UCTRL_DEV_ATT_MASK                       equ 0008h
UCTRL_PKT_DIS_POSN                       equ 0004h
UCTRL_PKT_DIS_POSITION                   equ 0004h
UCTRL_PKT_DIS_SIZE                       equ 0001h
UCTRL_PKT_DIS_LENGTH                     equ 0001h
UCTRL_PKT_DIS_MASK                       equ 0010h
UCTRL_SE0_POSN                           equ 0005h
UCTRL_SE0_POSITION                       equ 0005h
UCTRL_SE0_SIZE                           equ 0001h
UCTRL_SE0_LENGTH                         equ 0001h
UCTRL_SE0_MASK                           equ 0020h

// Register: UADDR
#define UADDR UADDR
UADDR                                    equ 0196h

// Register: USWSTAT
#define USWSTAT USWSTAT
USWSTAT                                  equ 0197h

// Register: UEP0
#define UEP0 UEP0
UEP0                                     equ 0198h
// bitfield definitions
UEP0_EP_STALL_POSN                       equ 0000h
UEP0_EP_STALL_POSITION                   equ 0000h
UEP0_EP_STALL_SIZE                       equ 0001h
UEP0_EP_STALL_LENGTH                     equ 0001h
UEP0_EP_STALL_MASK                       equ 0001h
UEP0_EP_IN_EN_POSN                       equ 0001h
UEP0_EP_IN_EN_POSITION                   equ 0001h
UEP0_EP_IN_EN_SIZE                       equ 0001h
UEP0_EP_IN_EN_LENGTH                     equ 0001h
UEP0_EP_IN_EN_MASK                       equ 0002h
UEP0_EP_OUT_EN_POSN                      equ 0002h
UEP0_EP_OUT_EN_POSITION                  equ 0002h
UEP0_EP_OUT_EN_SIZE                      equ 0001h
UEP0_EP_OUT_EN_LENGTH                    equ 0001h
UEP0_EP_OUT_EN_MASK                      equ 0004h
UEP0_EP_CTL_DIS_POSN                     equ 0003h
UEP0_EP_CTL_DIS_POSITION                 equ 0003h
UEP0_EP_CTL_DIS_SIZE                     equ 0001h
UEP0_EP_CTL_DIS_LENGTH                   equ 0001h
UEP0_EP_CTL_DIS_MASK                     equ 0008h

// Register: UEP1
#define UEP1 UEP1
UEP1                                     equ 0199h
// bitfield definitions
UEP1_EP_STALL_POSN                       equ 0000h
UEP1_EP_STALL_POSITION                   equ 0000h
UEP1_EP_STALL_SIZE                       equ 0001h
UEP1_EP_STALL_LENGTH                     equ 0001h
UEP1_EP_STALL_MASK                       equ 0001h
UEP1_EP_IN_EN_POSN                       equ 0001h
UEP1_EP_IN_EN_POSITION                   equ 0001h
UEP1_EP_IN_EN_SIZE                       equ 0001h
UEP1_EP_IN_EN_LENGTH                     equ 0001h
UEP1_EP_IN_EN_MASK                       equ 0002h
UEP1_EP_OUT_EN_POSN                      equ 0002h
UEP1_EP_OUT_EN_POSITION                  equ 0002h
UEP1_EP_OUT_EN_SIZE                      equ 0001h
UEP1_EP_OUT_EN_LENGTH                    equ 0001h
UEP1_EP_OUT_EN_MASK                      equ 0004h
UEP1_EP_CTL_DIS_POSN                     equ 0003h
UEP1_EP_CTL_DIS_POSITION                 equ 0003h
UEP1_EP_CTL_DIS_SIZE                     equ 0001h
UEP1_EP_CTL_DIS_LENGTH                   equ 0001h
UEP1_EP_CTL_DIS_MASK                     equ 0008h

// Register: UEP2
#define UEP2 UEP2
UEP2                                     equ 019Ah
// bitfield definitions
UEP2_EP_STALL_POSN                       equ 0000h
UEP2_EP_STALL_POSITION                   equ 0000h
UEP2_EP_STALL_SIZE                       equ 0001h
UEP2_EP_STALL_LENGTH                     equ 0001h
UEP2_EP_STALL_MASK                       equ 0001h
UEP2_EP_IN_EN_POSN                       equ 0001h
UEP2_EP_IN_EN_POSITION                   equ 0001h
UEP2_EP_IN_EN_SIZE                       equ 0001h
UEP2_EP_IN_EN_LENGTH                     equ 0001h
UEP2_EP_IN_EN_MASK                       equ 0002h
UEP2_EP_OUT_EN_POSN                      equ 0002h
UEP2_EP_OUT_EN_POSITION                  equ 0002h
UEP2_EP_OUT_EN_SIZE                      equ 0001h
UEP2_EP_OUT_EN_LENGTH                    equ 0001h
UEP2_EP_OUT_EN_MASK                      equ 0004h
UEP2_EP_CTL_DIS_POSN                     equ 0003h
UEP2_EP_CTL_DIS_POSITION                 equ 0003h
UEP2_EP_CTL_DIS_SIZE                     equ 0001h
UEP2_EP_CTL_DIS_LENGTH                   equ 0001h
UEP2_EP_CTL_DIS_MASK                     equ 0008h

